tap "homebrew/bundle"
# Load/unload environment variables based on $PWD
brew "direnv"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Command-driven, interactive function plotting
brew "gnuplot"
# Like cURL, but for gRPC
brew "grpcurl"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@20"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line client for WebSockets
brew "websocat"
# HTTP benchmarking tool
brew "wrk"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
# Replacement for Docker Desktop
cask "orbstack"
